In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data_urut.csv')

In [3]:
df

       id          nama
0       1     Data ke-1
1       2     Data ke-2
2       3     Data ke-3
3       4     Data ke-4
4       5     Data ke-5
..    ...           ...
987   996   Data ke-996
988   997   Data ke-997
989   998   Data ke-998
990   999   Data ke-999
991  1000  Data ke-1000

[992 rows x 2 columns]

In [4]:
df['id'].describe()

count     992.000000
mean      501.506048
std       288.617904
min         1.000000
25%       252.750000
50%       502.500000
75%       751.250000
max      1000.000000
Name: id, dtype: float64

In [5]:
df['id'].describe()

count     992.000000
mean      501.506048
std       288.617904
min         1.000000
25%       252.750000
50%       502.500000
75%       751.250000
max      1000.000000
Name: id, dtype: float64

In [6]:
urut = [i for i in range(df['id'].min(), df['id'].max() + 1)]

In [7]:
urut_df = pd.DataFrame(urut, columns=['urut'])
urut_df

     urut
0       1
1       2
2       3
3       4
4       5
..    ...
995   996
996   997
997   998
998   999
999  1000

[1000 rows x 1 columns]

In [8]:
urut_df[~urut_df['urut'].isin(df['id'])]

     urut
21     22
171   172
211   212
212   213
297   298
491   492
624   625
971   972

In [9]:
df[(df['id'] > 20) & (df['id'] < 24)]

    id        nama
20  21  Data ke-21
21  23  Data ke-23

In [10]:
df[(df['id'] > 170) & (df['id'] < 174)]

      id         nama
169  171  Data ke-171
170  173  Data ke-173

In [11]:
df[(df['id'] > 210) & (df['id'] < 215)]

      id         nama
208  211  Data ke-211
209  214  Data ke-214

# Min, Max, Range

## Min

In [12]:
df['id'].min()

1

## Max

In [13]:
df['id'].max()

1000

## Range

In [14]:
angka = range(1, 10)
for i in angka:
    print(i)

1
2
3
4
5
6
7
8
9

In [15]:
[i for i in range(1, 10)]

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [16]:
[i for i in range(1, 11)]

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]